{
  "projects": [
    {
      "id": "proj-apc-2027",
      "title": "APC Enugu 2027 Election Platform",
      "slug": "apc-enugu-2027-platform",
      "description": "High-performance grassroots mobilization platform connecting voters to leadership through real-time membership registration, news updates, and an interactive polling unit locator for all 17 LGAs in Enugu State.",
      "longDescription": "The APC Enugu 2027 project is a comprehensive digital advocacy solution designed to bridge the gap between political leadership and the electorate.\n\nKey features include:\n* **Polling Unit Locator:** A custom-built, responsive tool allowing voters to instantly find their specific polling unit across 17 Local Government Areas without page reloads.\n* **Membership Portal:** A seamless digital registration system that captures volunteer data and issues unique membership IDs.\n* **Admin Dashboard:** A secure, PHP-based backend for campaign managers to publish news, manage registered members, and oversee community forums.\n* **Community Forum:** An interactive space for constituents to discuss policies and receive updates.\n* **Performance First:** Architected with Vanilla JavaScript and native PHP to ensure sub-second load times on 3G mobile networks, making it accessible to the widest possible audience.",
      "category": "fullstack",
      "categoryLabel": "Civic Tech & Political Advocacy",
      "technologies": [
        "PHP",
        "MySQL",
        "JavaScript",
        "HTML5",
        "CSS3",
        "FontAwesome"
      ],
      "imageUrl": "/images/projects/apc-enugu-2027.png",
      "liveUrl": "https://apcgat2027enugu.com.ng",
      "githubUrl": "https://github.com/Hubert24hrs/apc-enugu-2027",
      "metrics": {},
      "featured": true,
      "published": true,
      "order": 1
    }
  ],
  "certifications": [],
  "testimonials": [],
  "messages": [],
  "settings": {
    "heroTitle": "Idoko Hubert",
    "heroSubtitle": "AI & ML Engineer | End-to-End Data Solutions Architect | Full-Stack Mobile & Web Developer",
    "aboutContent": "I design and deploy end-to-end AI and data-driven solutions by integrating machine learning, advanced analytics, and full-stack mobile and web development to build scalable, production-ready systems. With over three years of hands-on experience, I transform complex data into actionable insights and develop intelligent applications that deliver measurable impact.\n\nI excel in solution architecture, data pipeline optimization, cloud-native development, API integration, and deploying AI models in real-world environments. My work combines technical depth with product-focused thinking, enabling me to build reliable, high-impact solutions that align with business goals and scale globally, setting me apart in a competitive field.",
    "resumeUrl": "/resume.pdf",
    "linkedinUrl": "https://www.linkedin.com/in/hubert-idoko-47b817342",
    "githubUrl": "https://github.com/Hubert24hrs",
    "twitterUrl": "",
    "kaggleUrl": "",
    "mediumUrl": "",
    "blogUrl": null
  }
}